app/views/checkers/index.html.erb

SELECT "personal_databases".* FROM "personal_databases"
---
<% if false %>
<% PersonalDatabase.all.each do |record| %>