app/controllers/checkers_controller.rb

SELECT "personal_databases".* FROM "personal_databases" WHERE "personal_databases"."height" = ?  [["height", 0]]
---
  def result
    @bmi = 1.0 * params[:weight].to_i / ((params[:height].to_i / 100.0)  ** 2)
    if @bmi < 18.4 then
      @judge = "Too thin"
    elsif @bmi > 18.5 && @bmi < 24.9 then
      @judge = "Just"
    else
      @judge = "Fat!"
    end

    @model = PersonalDatabase.where(height: params[:height])